tests/Fixtures/stripe/invoice.payment_succeeded.real.json

{
  "id": "evt_1SWjQ41d2H50O3q44Vww7WvD",
  "object": "event",
  "api_version": "2025-06-30.basil",
  "created": 1763927879,
  "data": {
    "object": {
      "id": "in_1SWjQ11d2H50O3q4pxnmQCuv",
      "object": "invoice",
      "account_country": "US",
      "account_name": "Bread of Grace Ministries sandbox",
      "account_tax_ids": null,
      "amount_due": 1111,
      "amount_overpaid": 0,
      "amount_paid": 1111,
      "amount_remaining": 0,
      "amount_shipping": 0,
      "application": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": {
        "disabled_reason": null,
        "enabled": false,
        "liability": null,
        "provider": null,
        "status": null
      },
      "automatically_finalizes_at": null,
      "billing_reason": "subscription_create",
      "collection_method": "charge_automatically",
      "created": 1763927877,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_TTQ3dmp1Lkzlq2",
      "customer_address": null,
      "customer_email": "ryanmillergm@gmail.com",
      "customer_name": null,
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discounts": [],
      "due_date": null,
      "effective_at": 1763927877,
      "ending_balance": 0,
      "footer": null,
      "from_invoice": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1Rosef1d2H50O3q4/test_YWNjdF8xUm9zZWYxZDJINTBPM3E0LF9UVGduVTJSbjVreTNPdUhQMUIyMW9WbXFDeVNOckpDLDE1NDQ2ODY4MA0200cR0sKcs0?s=ap",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1Rosef1d2H50O3q4/test_YWNjdF8xUm9zZWYxZDJINTBPM3E0LF9UVGduVTJSbjVreTNPdUhQMUIyMW9WbXFDeVNOckpDLDE1NDQ2ODY4MA0200cR0sKcs0/pdf?s=ap",
      "issuer": {
        "type": "self"
      },
      "last_finalization_error": null,
      "latest_revision": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1SWjQ01d2H50O3q4yCyHisPn",
            "object": "line_item",
            "amount": 1111,
            "currency": "usd",
            "description": "1 × Monthly donation (at $11.11 / month)",
            "discount_amounts": [],
            "discountable": true,
            "discounts": [],
            "invoice": "in_1SWjQ11d2H50O3q4pxnmQCuv",
            "livemode": false,
            "metadata": {
              "user_id": "1",
              "pledge_id": "11"
            },
            "parent": {
              "invoice_item_details": null,
              "subscription_item_details": {
                "invoice_item": null,
                "proration": false,
                "proration_details": {
                  "credited_items": null
                },
                "subscription": "sub_1SWjQ11d2H50O3q4TdQNgGjf",
                "subscription_item": "si_TTgn9IB9f1ctyH"
              },
              "type": "subscription_item_details"
            },
            "period": {
              "end": 1766519876,
              "start": 1763927876
            },
            "pretax_credit_amounts": [],
            "pricing": {
              "price_details": {
                "price": "price_1SWjQ01d2H50O3q4KlIjIX31",
                "product": "prod_TTgnIBeaRjCW3i"
              },
              "type": "price_details",
              "unit_amount_decimal": "1111"
            },
            "quantity": 1,
            "taxes": []
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1SWjQ11d2H50O3q4pxnmQCuv/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": null,
      "number": "HGLC9ZNI-0009",
      "on_behalf_of": null,
      "parent": {
        "quote_details": null,
        "subscription_details": {
          "metadata": {
            "user_id": "1",
            "pledge_id": "11"
          },
          "subscription": "sub_1SWjQ11d2H50O3q4TdQNgGjf"
        },
        "type": "subscription_details"
      },
      "payment_settings": {
        "default_mandate": null,
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1763927876,
      "period_start": 1763927876,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "receipt_number": null,
      "rendering": null,
      "shipping_cost": null,
      "shipping_details": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1763927877,
        "marked_uncollectible_at": null,
        "paid_at": 1763927876,
        "voided_at": null
      },
      "subtotal": 1111,
      "subtotal_excluding_tax": 1111,
      "test_clock": null,
      "total": 1111,
      "total_discount_amounts": [],
      "total_excluding_tax": 1111,
      "total_pretax_credit_amounts": [],
      "total_taxes": [],
      "webhooks_delivered_at": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_upoO5eGeW1NSNK",
    "idempotency_key": "013e215a-bbb9-4b97-bcae-fda2385bdb81"
  },
  "type": "invoice.payment_succeeded"
}